int/auto/OWSWSMigration/resources/dataBank/TeamEnv/Req/FetchBookedPackages_TC001.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:res="http://webservices.micros.com/ows/5.1/Reservation.wsdl">
   <soapenv:Header>
      <OGHeader primaryLangID="E" timeStamp="KEYWORD_GMT_TIMESTAMP" transactionID="1100" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <Origin entityID="NIRCH1" systemType="WEB"/>
         <Destination entityID="TI" systemType="ORS"/>
         <Authentication>
            <UserCredentials>
               <UserName>SUPERVISOR</UserName>
               <UserPassword>SCRUMBIZ10</UserPassword>
               <Domain>NIRMAL</Domain>
            </UserCredentials>
         </Authentication>
      </OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:FetchBookedPackagesRequest>
         <res:HotelReference chainCode="AISA" hotelCode="NIRMAL"/>
         <res:ConfirmationNumber source="OPERA" type="INTERNAL">Var_ConfirmationNumber</res:ConfirmationNumber>
      </res:FetchBookedPackagesRequest>
   </soapenv:Body>
</soapenv:Envelope>